#+TITLE: May 10, 2017 - May 26, 2017
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE | CANCELED |
|------+------+-------------+---------+------+----------|
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME   | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|--------+-----------+--------+------+-----------+--------------+------------|
| Amey   |         0 |      0 |    0 |         0 |   2017-05-18 | ---------- |
| Mpduty |         0 |      0 |    0 |         0 |   2017-05-18 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  60 ++--##################################---+-------+--------+-------+--++   
:     |   ....                                                              |   
:     |       ....                                           ACTUAL ####### |   
:  50 ++          ....                                        IDEAL .......++   
:     |               .....                                                 |   
:     |                    ....                                             |   
:  40 ++                       ....                                        ++   
:     |                            ....                                     |   
:     |                                ...                                  |   
:  30 ++                                  .                                ++   
:     |                                    .......                          |   
:     |                                           .                         |   
:  20 ++                                           ....                    ++   
:     |                                                .....                |   
:     |                                                     ....            |   
:  10 ++                                                        ....       ++   
:     |                                                             ....    |   
:     |                                                                 ....|   
:   0 ++------+-------+--------+-------+-------+-------+--------+-------+--+.   
:     0       2       4        6       8       10      12       14      16      
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED |
|-----+------------+--------+-------+-----------------|
|   1 | 2017-05-10 |   60.0 |    56 |                 |
|   2 | 2017-05-11 |   60.0 |    53 |                 |
|   3 | 2017-05-12 |   60.0 |    49 |                 |
|   4 | 2017-05-13 |   60.0 |    46 |                 |
|   5 | 2017-05-14 |   60.0 |    42 |                 |
|   6 | 2017-05-15 |   60.0 |    39 |                 |
|   7 | 2017-05-16 |   60.0 |    35 |                 |
|   8 | 2017-05-17 |   60.0 |    32 |                 |
|   9 | 2017-05-18 |   60.0 |    28 |                 |
|  10 | 2017-05-19 |        |    25 |                 |
|  11 | 2017-05-20 |        |    21 |                 |
|  12 | 2017-05-21 |        |    18 |                 |
|  13 | 2017-05-22 |        |    14 |                 |
|  14 | 2017-05-23 |        |    11 |                 |
|  15 | 2017-05-24 |        |     7 |                 |
|  16 | 2017-05-25 |        |     4 |                 |
|  17 | 2017-05-26 |        |     0 |                 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                  | TASKID             | OWNER  | PRIORITY | TODO | ESTIMATED | ACTUAL |
|-------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| TASKS                                                 |                    |        | B        |      |      60.0 |        |
|-------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| READING                                               |                    |        | B        |      |      32.0 |        |
| Study of Linux kernel bug life-cycle                  | READING.1495095647 | mpduty | B        |      |      16.0 |        |
| Study of kernel regression testing tools              | READING.1495095693 | mpduty | B        |      |      16.0 |        |
|-------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| WRITING                                               |                    |        | B        |      |      24.0 |        |
| Make flow diagram for audio fingerprinting            | WRITING.1495095749 | amey   | B        |      |       4.0 |        |
| Defining and including parameters                     | WRITING.1495095780 | amey   | B        |      |       4.0 |        |
| Review of flow diagram, parameters and proposal       | WRITING.1495095805 | amey   | B        |      |       4.0 |        |
| Flow diagram from phases/modules                      | WRITING.1495095922 | amey   | B        |      |       4.0 |        |
| Add parameters                                        | WRITING.1495096024 | amey   | B        |      |       4.0 |        |
| Dry run and space-time complexity                     | WRITING.1495096110 | shaks  | B        |      |       4.0 |        |
|-------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| TESTING                                               |                    |        | B        |      |       4.0 |        |
| Dry runs and basic time and space complexity analysis | TESTING.1495095842 | amey   | B        |      |       4.0 |        |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2017-05-10 Wed>
  :wpd-mpduty: 2
  :wpd-amey:   2
  :END:
** READING
*** IN_PROGRESS Study of Linux kernel bug life-cycle
    :PROPERTIES:
    :ESTIMATED: 16.0
    :ACTUAL:
    :OWNER: mpduty
    :ID: READING.1495095647
    :TASKID: READING.1495095647
    :END:
    :LOGBOOK:
    CLOCK: [2017-05-20 Sat 09:15]--[2017-05-20 Sat 10:05] =>  0:50
    CLOCK: [2017-05-19 Fri 08:10]--[2017-05-19 Fri 10:20] =>  2:10
    CLOCK: [2017-05-17 Wed 07:45]--[2017-05-17 Wed 10:15] =>  2:30
    :END:
    Study of bug reports, bug fixes and bug closes related to the
    Linux kernel from two places:

    https://fedoraproject.org/wiki/KernelBugTriage
    https://bugzilla.kernel.org/

    Exploring
    https://bugzilla.redhat.com/query.cgi? and
    https://bugzill.kernel.org/query.cgi

    Exploring tools for website scraping and finally decided with
    scrapy.
*** Study of kernel regression testing tools
    :PROPERTIES:
    :ESTIMATED: 16.0
    :ACTUAL:
    :OWNER: mpduty
    :ID: READING.1495095693
    :TASKID: READING.1495095693
    :END:
    Use and study of some kernel regression testing tools.
** WRITING
*** IN_PROGRESS Make flow diagram for audio fingerprinting
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1495095749
    :TASKID: WRITING.1495095749
    :END:
    :LOGBOOK:
    CLOCK: [2017-05-18 Thu 22:23]--[2017-05-18 Wed 23:45] =>  1:22
    CLOCK: [2017-05-18 Thu 16:29]--[2017-05-18 Wed 17:15] =>  0:46
    CLOCK: [2017-05-18 Thu 13:52]--[2017-05-18 Wed 15:54] =>  2:02
    CLOCK: [2017-05-17 Wed 21:00]--[2017-05-17 Wed 22:00] =>  1:00
    :END:
*** Defining and including parameters
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1495095780
    :TASKID: WRITING.1495095780
    :END:
*** Review of flow diagram, parameters and proposal
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1495095805
    :TASKID: WRITING.1495095805
    :END:
*** Flow diagram from phases/modules
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1495095922
    :TASKID: WRITING.1495095922
    :END:
    Flow diagram: A diagram representing processing of data from
    various phases/modules like pre-processing, Fast fourier
    transform, feature extraction etc.
*** Add parameters
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1495096024
    :TASKID: WRITING.1495096024
    :END:
    Parameters on which phases are going to depend. Like range of
    operating frequency, sampling rate etc.
*** Dry run and space-time complexity
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: shaks
    :ID: WRITING.1495096110
    :TASKID: WRITING.1495096110
    :END:
** TESTING
*** Dry runs and basic time and space complexity analysis
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: TESTING.1495095842
    :TASKID: TESTING.1495095842
    :END:
